---
kind: type
id: T:Autodesk.Revit.DB.CategorySetIterator
source: html/6fb4ca61-9a83-2690-c818-0c56826c614d.htm
---
# Autodesk.Revit.DB.CategorySetIterator

An iterator to a category set.

## Syntax (C#)
```csharp
public abstract class CategorySetIterator : APIObject,
	IEnumerator
```